10/data/attachments/676f3360a4363034.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bd8adb16-4a75-4703-bb95-923bcd3b443a</nif:username>
            <nif:friendToBeAdded>Michael_no_Friend_26611_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>